#ifndef _BILLBORD_H_
#define _BILLBORD_H_
/*******************************************************************************
*
*	インクルードファイル
*
*******************************************************************************/

//マクロ定義
/*ポリゴンの幅の半分*/
#define billboard_WIDTH ( 50.0f / 2 )
/*ポリゴンの高さの半分*/
#define billboard_HEIGHT ( 50.0f / 2 )


/*******************************************************************************
*
*	構造体の定義
*
*******************************************************************************/

/*******************************************************************************
*
*	クラスの定義
*
*******************************************************************************/
class CBillbord : public CScene3D
{
protected:

	//作業用変数
	float m_Rot;







public :
	CBillbord(int Prioriry = 1);
	~CBillbord();
	HRESULT Init ( void );
	void Uninit ( void );
	void Update ( void ) ;
	void Draw ( void ) ;
	static CBillbord* Create(void);
	//D3DXVECTOR3 GetPosition ( void );




};

/*******************************************************************************
*
*	プロトタイプ宣言
*
*
*******************************************************************************/
#endif