#pragma once
#ifndef _BLINK_H_
#define _BLINK_H_
/*******************************************************************************
*
*	インクルードファイル
*
*******************************************************************************/


/*描画するポリゴン数*/
#define PRIMITIVE ( 2 )
//テクスチャの数
#define POKYGON_MAX ( 1 )


/*******************************************************************************
*
*	構造体の定義
*
*******************************************************************************/
/*******************************************************************************
*
*	クラスの定義
*
*******************************************************************************/
class CBlink : public CScene2D
{
protected:
	float m_Width, m_Height;
	int m_Alpha;
	int m_Cnt;


public:
	CBlink(int Prioriry = 2);
	~CBlink();
	HRESULT Init(const char *filename);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Alpha(void);
	static CBlink* Create(const char *filename,float Width,float Height,D3DXVECTOR3 Pos);



};

/*******************************************************************************
*
*	プロトタイプ宣言
*
*
*******************************************************************************/
#endif