/*******************************************************************************
*
*	インクルードファイル
*
*******************************************************************************/
#include "main.h"
/*******************************************************************************
*
*	マクロ定義
*
*******************************************************************************/
/*******************************************************************************
*
*	グローバル変数
*
*******************************************************************************/
/*******************************************************************************
*
*	プロトタイプ宣言
*
*
*******************************************************************************/

//コンストラクタ
CLight::CLight()
{

}
//デストラクタ
CLight::~CLight()
{
}

/*******************************************************************************
*
*	初期化
*
*
*******************************************************************************/
void CLight:: Init ( void )
{
	D3DXVECTOR3 vecDir ;
	CRenderer *Renderer ;
	Renderer = GetManager ()->GetRenderer();	
	LPDIRECT3DDEVICE9 pDevice = Renderer ->GetDevice();





	//ライト設定
	/********1つ目のライト********/
	/*中身のクリア*/
	ZeroMemory ( &m_aLight [ 0 ] , sizeof ( D3DLIGHT9 ) ) ;
	/*平行光源*/
	m_aLight [ 0 ] . Type = D3DLIGHT_DIRECTIONAL ;
	/*光の色*/
	m_aLight [ 0 ] . Diffuse = D3DXCOLOR ( 1.0f , 1.0f , 1.0f , 1.0f ) ;
	/*光の向き*/
	//vecDir = D3DXVECTOR3 ( -0.3f , -0.5f , -0.3f ) ;
	vecDir = D3DXVECTOR3 ( 0.0f , -0.3f , 0.7f ) ;
	/*正規化*/
	D3DXVec3Normalize ( ( D3DXVECTOR3 * ) & m_aLight [ 0 ] . Direction , & vecDir ) ;
	/*ライトの設定*/
	pDevice -> SetLight ( 0 , & m_aLight [ 0 ] ) ;
	/*ライトを有効にする*/
	pDevice -> LightEnable ( 0 , TRUE ) ;

	/********2つ目のライト********/

	/*中身のクリア*/
	ZeroMemory ( &m_aLight [ 1 ] , sizeof ( D3DLIGHT9 ) ) ;
	/*平行光源*/
	m_aLight [ 1 ] . Type = D3DLIGHT_DIRECTIONAL ;
	/*光の色*/
	m_aLight [ 1 ] . Diffuse = D3DXCOLOR ( 0.5f , 0.5f , 0.5f , 1.0f ) ;
	/*光の向き*/
	vecDir = D3DXVECTOR3 ( -0.6f , -0.7f , -0.5f ) ;
	/*正規化*/
	D3DXVec3Normalize ( ( D3DXVECTOR3 * ) & m_aLight [ 1 ] . Direction , & vecDir ) ;
	/*ライトの設定*/
	pDevice -> SetLight ( 1 , & m_aLight [ 1 ] ) ;
	/*ライトを有効にする*/
	pDevice -> LightEnable ( 1 , TRUE ) ;

	///********3つ目のライト********/

	/*中身のクリア*/
	ZeroMemory ( &m_aLight [ 2 ] , sizeof ( D3DLIGHT9 ) ) ;
	/*平行光源*/
	m_aLight [ 2 ] . Type = D3DLIGHT_DIRECTIONAL ;
	/*光の色*/
	m_aLight [ 2 ] . Diffuse = D3DXCOLOR ( 0.2f , 0.2f , 0.2f , 1.0f ) ;
	/*光の向き*/
	vecDir = D3DXVECTOR3 ( 0.0f , 0.0f , -0.7f ) ;
	/*正規化*/
	D3DXVec3Normalize ( ( D3DXVECTOR3 * ) & m_aLight [ 2 ] . Direction , & vecDir ) ;
	/*ライトの設定*/
	pDevice -> SetLight ( 2 , & m_aLight [ 2 ] ) ;
	/*ライトを有効にする*/
	pDevice -> LightEnable ( 2 , TRUE ) ;

	/*全ライトが有効か*/
	pDevice -> SetRenderState ( D3DRS_LIGHTING , TRUE ) ;




}


/*******************************************************************************
*
*	終了
*
*
*******************************************************************************/
/*******************************************************************************
*
*	終了処理関数
*	引数 : 無し
*	戻り値 : 無し
*******************************************************************************/
void CLight::Uninit(void)
{

}
/*******************************************************************************
*
*	更新
*
*
*******************************************************************************/
void CLight::Update(void)
{
}
