/*******************************************************************************
*
*	インクルードファイル
*
*******************************************************************************/
#include "main.h"
#include "result.h"
/*******************************************************************************
*
*	マクロ定義
*
*******************************************************************************/
/*******************************************************************************
*
*	グローバル変数
*
*******************************************************************************/
/*******************************************************************************
*
*	プロトタイプ宣言
*
*
*******************************************************************************/

//コンストラクタ
CResult::CResult()
{
}
//デストラクタ
CResult::~CResult()
{
}

//更新
void CResult::Init(void)
{
	CResultBg::Create();
	CResultRogo::Create();
	m_Cnt = 0;
}
//描画
void CResult::Uninit(void)
{
	CScene::UninitAll();
}
//終了
void CResult::Update(void)
{
	CInput *Input;
	Input = GetManager()->GetInput();
	m_Cnt++;

	if(m_Cnt >= 300)
	{

		if (Input->GetKeyboardTrigger(DIK_RETURN))
		{
			CFade::Start(new CTitle);
		}
		m_Cnt = 300;
	}
	CScene::UpdateAll();
	
}
//個別に消す
void CResult::Draw(void)
{
	CScene::DrawAll();
}
