#ifndef _SCENE3D_H_
#define _SCENE3D_H_
/*******************************************************************************
*
*	インクルードファイル
*
*******************************************************************************/

//マクロ定義

/*描画するポリゴン数*/
#define PRIMITIVE ( 2 )
//テクスチャの数
#define POKYGON_MAX ( 1 )

/*******************************************************************************
*
*	構造体の定義
*
*******************************************************************************/

/*******************************************************************************
*
*	クラスの定義
*
*******************************************************************************/
class CScene3D : public CScene
{
protected:
	/*テクスチャへのポインタ*/
	LPDIRECT3DTEXTURE9 m_pTexturePolygon ;
	/*頂点バッファへのポインタ*/
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffPolygon;

	/*ワールドマトリクス*/
	D3DXMATRIX m_mtxWorld ;





public :
	CScene3D(int Prioriry = 1);
	~CScene3D();
	HRESULT Init ( void );
	void Uninit ( void );
	void Update ( void ) ;
	void Draw ( void ) ;
	static CScene3D* Create(void);




};

/*******************************************************************************
*
*	プロトタイプ宣言
*
*
*******************************************************************************/
#endif