#ifndef _SOUNDGL_H_
#define _SOUNDGL_H_
/*******************************************************************************
*
*	インクルードファイル
*
*******************************************************************************/
#include "al.h"
#include "alut.h"



/*******************************************************************************
*
*	ライブラリのリンク
*
*******************************************************************************/
#pragma comment(lib, "OpenAL32.lib")
#pragma comment(lib, "alut.lib")

/*******************************************************************************
*
*	マクロ定義
*
*******************************************************************************/

#define SOUND_NUM (4)
#define SOURCE_NUM (16)

typedef enum
{
	SOUND_LABEL_BGM000 = 0,		// BGM0
	SOUND_LABEL_SE_OBJECT,		// オブジェクト
	SOUND_LABEL_SE_FUE,         //笛の音
	SOUND_LABEL_SE_ENTER,       //決定音
	SOUND_LABEL_SE_CRY,         //鳴き声
	SOUND_LABEL_MAX,
} SOUND_LABEL;

/*******************************************************************************
*
*	構造体の定義
*
*******************************************************************************/
/*******************************************************************************
*
*	クラスの定義
*
*******************************************************************************/
class CSoundGL
{

	
public :

	//コンストラクタ
	CSoundGL();
	//デストラクタ
	~CSoundGL();


	static ALuint m_buffer[SOUND_NUM], m_source[SOURCE_NUM];

	static void Init ( void );
	static void Uninit ( void );
	static void Load (void);
	static void Start ( SOUND_LABEL label,bool Loop );
	static void Stop ( SOUND_LABEL label );



};

/*******************************************************************************
*
*	プロトタイプ宣言
*
*
*******************************************************************************/
#endif