#ifndef _TITLEBG_H_
#define _TITLEBG_H_
/*******************************************************************************
*
*	インクルードファイル
*
*******************************************************************************/


/*描画するポリゴン数*/
#define PRIMITIVE ( 2 )
//テクスチャの数
#define POKYGON_MAX ( 1 )


/*******************************************************************************
*
*	構造体の定義
*
*******************************************************************************/
/*******************************************************************************
*
*	クラスの定義
*
*******************************************************************************/
class CTitleBg : public CScene
{
protected:
	/*テクスチャへのポインタ*/
	LPDIRECT3DTEXTURE9 m_pTexturePolygon ;
	/*頂点バッファへのポインタ*/
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffPolygon;
	/*ポリゴンの回転角*/
	D3DXVECTOR3 m_rotTime ;

	/*ポリゴンの対角線の長さ*/
	float m_fLengthTime ;

	/*ポリゴンの対角線の角度*/
	float m_fAngleTime ;

	/*アニメーションカウンター*/
	int m_nCounterAnimTime  ;


public :
	CTitleBg(int Prioriry = 2);
	~CTitleBg();
	HRESULT Init ( void  );
	void Uninit ( void );
	void Update ( void ) ;
	void Draw ( void ) ;
	static CTitleBg* Create(void);



};

/*******************************************************************************
*
*	プロトタイプ宣言
*
*
*******************************************************************************/
#endif